In [2]:
# Series 연산
from pandas import Series

s1 = Series([10, 15, 20], index=['일','이','삼'])
s2 = Series([2,4,6,8], index=['일','이','삼','사'])

In [4]:
s1 + 10  # 원본 변경이 안됨

일    20
이    25
삼    30
dtype: int64

In [5]:
s1 + s2

사     NaN
삼    26.0
이    19.0
일    12.0
dtype: float64

In [6]:
s3 = Series([1,2,3],index=['1줄','2줄','3줄'])

In [7]:
s1 + s3
# 전혀 계산이 안됨. 같은 인덱스 끼리 계산한다.
|
'''
1줄   NaN
2줄   NaN
3줄   NaN
삼    NaN
이    NaN
일    NaN
dtype: float64
'''

1줄   NaN
2줄   NaN
3줄   NaN
삼    NaN
이    NaN
일    NaN
dtype: float64

In [8]:
# DataFrame 연산

from pandas import DataFrame
import numpy as np

df1 = DataFrame(np.zeros((3,3), dtype='int32'), index=['one','two','three'])

In [9]:
df2 = df1 + 3
df2

       0  1  2
one    3  3  3
two    3  3  3
three  3  3  3

In [15]:
df3 = df1 * 2
df3

       0  1  2
one    0  0  0
two    0  0  0
three  0  0  0

In [16]:
df2 + df3

       0  1  2
one    3  3  3
two    3  3  3
three  3  3  3

In [17]:
df3 = DataFrame(np.ones((4,4), dtype='int32'), index=['one','two','three','four'])

In [18]:
df2 + df3 
# 없는 row, col 이 있다면!!
# float 로 자동 형변환 되었음

         0    1    2   3
four   NaN  NaN  NaN NaN
one    4.0  4.0  4.0 NaN
three  4.0  4.0  4.0 NaN
two    4.0  4.0  4.0 NaN

In [20]:
# 에러 처리를 해보자

df4 = df2.add(df3, fill_value=0)
df4

         0    1    2    3
four   1.0  1.0  1.0  1.0
one    4.0  4.0  4.0  1.0
three  4.0  4.0  4.0  1.0
two    4.0  4.0  4.0  1.0

In [21]:
df4.mean()

0    3.25
1    3.25
2    3.25
3    1.00
dtype: float64

In [22]:
df4.mean(axis=1) # 행단위로

four     1.00
one      3.25
three    3.25
two      3.25
dtype: float64

문자열이 있는 데이타프레임의 연산

In [25]:
mydata = {
          'name':['홍길동','박길동','김길동'], 
          'age':[22,33,44], 
          'dept':['컴공','국어','산업']
         }

In [27]:
df = DataFrame(mydata)
df

  name  age dept
0  홍길동   22   컴공
1  박길동   33   국어
2  김길동   44   산업

In [28]:
mydata + 10
# TypeError: unsupported operand type(s) for +: 'dict' and 'int'

TypeError: unsupported operand type(s) for +: 'dict' and 'int'